package Laptenkov;

import java.util.Arrays;
import java.util.Collection;
import java.util.Map;
import java.util.function.Predicate;
import java.util.stream.Collectors;
import java.util.stream.Stream;

/**
 * Lesson 10 homework
 *
 * Создать метод, который принимает массив строк и предикат.
 * И возвращает коллекцию, которая состоит из элементов отфильтрованных предикатом.
 *
 * Сгенерировать стрим - возрастающую бесконечную последовательность(1,2,3,4...)
 * и распечатать из нее первые 10 чисел, которые делятся нацело на 27.
 *
 * Объявить произвольный массив строк, отсортировать его по длине слова( от меньшего к большему)
 * и вывести на экран.
 *
 * Используя массив из упражнения 3 создать Map в которой поместить в качестве ключа длину,
 * а в качестве значения количество слов с этой длинной
 *
 */
public class Homework {

}


